#include <iostream>
#include <windows.h>
#include <cmath>

using namespace std;

int main()
{
    SetConsoleOutputCP(1251);
    
    double x{}, y{}, r{};
    int m{};
    
    // Завдання 1.
    cout << "1 Визначити, чи лежить точка А в області, обмеженою параболою у = 2 - х2 і віссю абсцис. Відповідь вивести у вигляді повідомлення." << endl;
    cout << "вкажіть координати X " << endl;
    cin >> x;
    cout << "вкажіть координати Y" << endl;
    cin >> y;
    if (y <= (-pow(x, 2) + 2) and y >= 0)
        cout << "точка A знаходиться в зазначених межах параболи" << endl;
    else cout << "точка A НЕ знаходиться в зазначених межах параболи" << endl;
    
    cout << endl;
     
    cout << "3 Дано координати точки x і y і радіус кола R. Центром кола є початок координат. Визначити лежить дана точка всередині кола" << endl;
    cout << "вкажіть R кола" << endl;
    cin >> r;
    cout << "вкажіть координати X " << endl;
    cin >> x;
    cout << "вкажіть координати Y" << endl;
    cin >> y;
    if (pow(x, 2) + pow(x, 2) <= pow(r, 2))
        cout << "вказана точка знаходиться в межах кола" << endl;
    else cout << "вказана точка НЕ знаходиться в межах кола" << endl;
    
    cout << endl;
    
    cout << "5 Ввести з клавіатури номер місяця. Визначити сезон в залежності від номера місяця і вивести повідомлення(весна(3, 4, 5), літо(6, 7, 8), осінь (9, 10, 11) зима(12, 1, 2))." << endl;
    cout << "введіть номер місяця " << endl;
    cin >> m;
    switch (m) {
        case 1: case 2: case 12: cout << "зазначений номер місяця належить до зимових"; break;
        case 3: case 4: case 5: cout << "зазначений номер місяця належить до весняних"; break;
        case 6: case 7: case 8: cout << "зазначений номер місяця належить до літніх"; break;
        case 9: case 10: case 11: cout << "зазначений номер місяця належить до осінніх"; break;
        default: cout << "перевірте значення, що вводяться, у році не буває місяців менше 1 і більше 12"; break;
    }

    return 0;
}
