#include <iostream>
#include <windows.h>
#include <cmath>

using namespace std;

int main()
{
    SetConsoleOutputCP(1251);
    
    //Базовий рівень
    
    int a{}, b{}, s1{}, s2{};

    cout << "1 Введіть з клавіатури два числа. Визначити, що більше сума квадратів або квадрат суми цих чисел.Відповідь вивести як повідомлення" << endl;
    cout << "введіть число a, b" << endl;
    cin >> a >> b;
    s1 = pow(a, 2) + pow(b, 2);
    s2 = pow(a + b, 2);
    if (s1 > s2)
        cout << "більше сума квадратів" << endl;
    else if (s1 < s2)
        cout << "більше квадрат суми чисел" << endl;
    else cout << "однакові значення" << endl;
    
    cout << "2 Розрахувати надбавку до зарплати за стаж, якщо стаж від 2 до 5 років, надбавка становить 2 %, якщо стаж від 5 до 10 років – 5 % .Ввести з клавіатури зарплату та стаж, вивести надбавку та суму до виплати." << endl;
    cout << "Введіть розмір зп і стаж" << endl;
    cin >> a >> b;
    if (b >= 2 and b < 5)
        cout << "надбавка=2%, до оплати=" << a * (1 + (2.0 / 100));
    else if (b >= 5 and b < 10)
        cout << "надбавка=5%, до оплати=" << a * (1 + (5.0 / 100));
        
    cout << "4 Ввести з клавіатури значення трьох сторін трикутника a, b і c і визначити, чи він прямокутний.Відповідь вивести як повідомлення." << endl;
    cout << "введіть сторони трикутника" << endl;
    cin >> a >> b >> s1;
    if (pow(a, 2) + pow(b, 2) == pow(s1, 2))
        cout << "трикутник прямокутний" << endl;
    else if (pow(a, 2) + pow(s1, 2) == pow(b, 2))
        cout << "трикутник прямокутний" << endl;
    else if (pow(b, 2) + pow(s1, 2) == pow(a, 2))
        cout << "трикутник прямокутний" << endl;
    else cout << "трикутник не прямокутний" << endl;

    return 0;
}
