// Реалізувати рекурсивну функцію для перевірки того, чи є задане число простим, яка отримує на вхід посилання і повертає true, якщо число є простим, і false у протилежному випадку

#include <iostream> 
using namespace std; 
 
bool is_prime(int n, int divisor = 2) { 
    /* 
    Рекурсивно перевіряє, чи є задане число простим. 
 
    Параметри: 
    n (int): число, яке потрібно перевірити 
    divisor (int): поточний дільник 
 
    Повертає: 
    bool: true, якщо число є простим, false - у протилежному випадку 
    */ 
 
    // Перевіряємо, чи n є меншим за 2 (від'ємне число або 0/1) 
    if (n < 2) { 
        return false; 
    } 
 
    // Перевіряємо, чи дільник більший або рівний квадратному кореню з n. 
    // Якщо так, то число є простим 
    if (divisor >= sqrt(n) + 1) { 
        return true; 
    } 
 
    // Якщо n ділиться без залишку на дільник, то число не є простим 
    if (n % divisor == 0) { 
        return false; 
    } 
 
    // Інакше рекурсивно викликаємо функцію зі збільшеним дільником 
    return is_prime(n, divisor + 1); 
}

int main() { 
    int n; 
    cout << "Enter a number: "; 
    cin >> n; 
    if (is_prime(n)) { 
        cout << n << " is prime." << endl; 
    } 
    else { 
        cout << n << " is not prime." << endl; 
    } 
    return 0; 
}
