/*
Директива #include <файли заголовків> - повідомляє компілятору, що робити - в цьому випадку вставити вміст файлу **
Директива #include "файли заголовків" - компілятор шукає його спочатку в каталозі, який містить файл вихідного коду, в якому присутня директива.
	Якщо файлу заголовка немає, компілятор шукає його в каталогах, де зберігається заголовок стандартні файли заголовків
*/

#include <iostream>
#include <windows.h>


using namespace std; // Простір імен (namespace) - призначений для запобігання проблем, пов'язаних з дублюванням назв, що застосовуються в програмі для різних цілей




int main() {
	SetConsoleOutputCP(1251);

	/*
	Змінна - це іменований фрагмент пам'яті комп'ютера, який можна використовувати для збереження даних, а оператор, який представляє імена однієї або більше змінних, називається оголошенням змінної. 
	Імена змінних можуть включати літери A-z (великі або малі), цифри 0-9 і підкреслення.
	Тип інформації, яку може містити змінна, називається її типом даних
	*/
	const float pi{ 3.14f };
	float d{};
	auto s = 0.0;
	cout << "Додайте діаметр кола: ";
	cin >> d;
	s = pi * d * d / 4;
	cout << "Площа кола =" << s << endl;

	return 0;
}