#include <iostream>
#include <windows.h>
#include <cmath>

using namespace std;

int main()
{
    SetConsoleOutputCP(1251);
    
    //Високий рівень
    
    int a{}, b{}, s1{}, s2{};
    double Body_Mass_Index{}, growth{};

    cout << "2 Дано двозначне число. Визначити: а) чи входить до нього цифра 5; б) чи входить до нього цифра а." << endl;
    cout << "введіть двозначне число ";
    cin >> a;
    cout << endl;
    cout << "введіть шукану цифру ";
    cin >> b;
    cout << endl;
    s1 = a / 10;
    s2 = a % 10;
    if (s1 == 5 or s2 == 5)
        cout << a << " число містить цифру 5 " << '\t';
    else cout << a << " число НЕ містить цифру 5 " << '\t';
    if (s1 == b or s2 == b)
        cout << a << " число містить цифру " << b << endl;
    else cout << a << " число НЕ містить цифру " << b << endl;    

    cout << "4 Написати програму, яка при введенні числа в діапазоні від 1 до 99 додає до нього слово 'копійка' у правильній формі.Наприклад, 1 копійка, 5 копійок, 42 копійки." << endl;
    cout << "введіть двозначне число ";
    cin >> a;
    b = a % 10;
    if (a > 9 and a < 21)
        cout << a << " копійок" << endl;
    else if (b == 1)
        cout << a << " копійка" << endl;
    else if (b > 1 and b < 5)
        cout << a << " копійки" << endl;
    else cout << a << " копійок" << endl;

    cout << "7 Дано ціле число від 1 до 365. Визначити, який день тижня випадає цього числа, якщо 1 січня – понеділок." << endl;
    cout << "введіть номер дня в році(365)";
    cin >> a;
    b = a % 7;
    if (b == 1) cout << a << '\t' << "Пн" << endl;
    else if (b == 2) cout << a << '\t' << "Вт" << endl;
    else if (b == 3) cout << a << '\t' << "Ср" << endl;
    else if (b == 4) cout << a << '\t' << "Чт" << endl;
    else if (b == 5) cout << a << '\t' << "Пт" << endl;
    else if (b == 6) cout << a << '\t' << "Сб" << endl;
    else if (b == 7) cout << a << '\t' << "Вс" << endl;
    else cout << a << '\t' << "я вас не зрозумів" << endl;

    cout << "8 Дано тризначне число. Визначити: а) чи є сума його цифр двоцифровим числом; б) чи є добуток його цифр трицифровим числом." << endl;
    cout << "введіть тризначне число ";
    cin >> a;
    b = a / 100;
    s1 = a % 100 / 10;
    s2 = a % 100 % 10;
    if (9 < (b + s1 + s2) and (b + s1 + s2) < 100) cout << a << '\t' << b + s1 + s2 << " сума чисел двозначна" << endl;
    else cout << a << '\t' << b + s1 + s2 << " сума чисел НЕ двозначна" << endl;
    //
    if (b * s1 * s2 > 99 ) cout << a << '\t' << b * s1 * s2 << " добуток його цифр трицифровим числом" << endl;
    else cout << a << '\t' << b * s1 * s2 << " добуток його цифр НЕ трицифровим числом" << endl;

    return 0;
}
