#include <windows.h>
#include <iostream>
#include <format>
#include <cmath>

using namespace std;

int main()
{
    SetConsoleOutputCP(1251);
    int w[]{ -6, 12, 3, -2, 16, 5, 6 }; //масив даних для обробки
    int n[9]; // масив зберігання проміжних результатів обробки згідно з варіантами


    cout << format("{:^}\t{:^}\t{:^}\t{:^}\t{:^}\t{:^}\t{:^}\t{:^}\t{:^}\t{:^}\t{:^}", "#", "v", "1", "2", "3", "4", "5", "6", "7", "8", "9") << endl;
    for (int i{ 0 }; i < 7; i++) {
        if (w[i] > 0) n[0] = 0; else n[0] = w[i]; // 1 Додатні елементи замінити нулями.
        if (w[i] < 0) n[1] = abs(w[i]); else n[1] = w[i]; // 2 Від’ємні елементи замінити їхніми модулями.
        if (w[i] < 4) n[2] = w[i] * 3; else n[2] = w[i]; // 3 Елементи, менші 4 помножити на 3.
        if (w[i] > 0) n[3] = pow(w[i],2); else n[3] = w[i]; // 4 Додатні елементи замінити їхніми квадратами.
        if (w[i] < 0) n[4] = -1; else n[4] = w[i]; // 5 Від’ємні елементи замінити на –1.
        if (1 <= i and i < 6) n[5] = i; else n[5] = w[i]; // 6 Елементи в інтервалі від 2 до 6 замінити їхніми порядковими номерами.
        if (w[i] < 0) n[6] = w[i] * 4; else n[6] = w[i]; // 7 Від’ємні елементи помножити на 4.
        if (w[i] > 3) n[7] = w[i] - 2; else n[7] = w[i]; // 8 Елементи, що мають значення більше 3 зменшити на 2.
        if ((i + 1) % 2 > 0) n[8] = 0; else n[8] = w[i]; // 9 Непарні елементи замінити на 0
        cout << format("{:^}\t{:^}\t{:3}\t{:3}\t{:3}\t{:3}\t{:3}\t{:3}\t{:3}\t{:3}\t{:3}", i + 1, w[i], n[0], n[1], n[2], n[3], n[4], n[5], n[6], n[7], n[8]) << endl;
    }

    
    return 0;
}
